In [1]:
""" Essential Functionality """

' Essential Functionality '

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
obj = pd.Series([4.5,7.2,-5.3,3.6],index=['d','b','a','c'])

In [5]:
obj

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [6]:
#Reindexation sur Series
obj2 = obj.reindex(['a','b','c','d','e'])

In [8]:
obj2

a   -5.3
b    7.2
c    3.6
d    4.5
e    NaN
dtype: float64

In [9]:
# Forward fill
obj3 = pd.Series(['blue','purple','yellow'],index=[0,2,4])

In [10]:
obj3

0      blue
2    purple
4    yellow
dtype: object

In [12]:
obj3.reindex(range(6),method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

In [13]:
#Reindexation sur DataFrame
frame = pd.DataFrame(np.arange(9).reshape((3,3)),
                     index=['a','c','d'],
                     columns=['Ohio','Texas','California'])

In [14]:
frame

   Ohio  Texas  California
a     0      1           2
c     3      4           5
d     6      7           8

In [15]:
frame2 = frame.reindex(['a','b','c','d'])

In [16]:
frame2

   Ohio  Texas  California
a   0.0    1.0         2.0
b   NaN    NaN         NaN
c   3.0    4.0         5.0
d   6.0    7.0         8.0

In [17]:
#Les colonnes peuvet être réindexées avec le keyword column
states = ['Texas','Utah','California']

In [18]:
frame.reindex(columns=states)

   Texas  Utah  California
a      1   NaN           2
c      4   NaN           5
d      7   NaN           8

In [19]:
""" Retirer un elt d'une Series"""

" Retirer un elt d'une Series"

In [20]:
obj = pd.Series(np.arange(5.),index=['a','b','c','d','e'])

In [21]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
e    4.0
dtype: float64

In [22]:
new_obj = obj.drop('c')

In [23]:
new_obj

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [24]:
obj.drop(['d','c'])

a    0.0
b    1.0
e    4.0
dtype: float64

In [26]:
# Drop avec DataFrame
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio','Colorado','Utah','New York'],
                    columns=['one','two','three','four'])

In [27]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [28]:
#Faire un drop sur les lignes
data.drop(['Colorado','Ohio'])

          one  two  three  four
Utah        8    9     10    11
New York   12   13     14    15

In [29]:
#Faire un drop sur les colonnes
data.drop('two',axis=1)

          one  three  four
Ohio        0      2     3
Colorado    4      6     7
Utah        8     10    11
New York   12     14    15

In [30]:
data.drop(['two','four'],axis='columns')

          one  three
Ohio        0      2
Colorado    4      6
Utah        8     10
New York   12     14

In [33]:
#Keyword : inplace. effectue l'opération sur l'objet même
obj.drop('c',inplace=True)

In [36]:
obj #'c' a été supprimé

a    0.0
b    1.0
d    3.0
e    4.0
dtype: float64

In [37]:
""" Indexing, Selection and Filtering """

' Indexing, Selection and Filtering '

In [38]:
#Indexing sur Series ( Similaire su les arrays)
obj = pd.Series(np.arange(4.),index=['a','b','c','d'])

In [39]:
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [40]:
obj['a']

0.0

In [41]:
obj[1:3]

b    1.0
c    2.0
dtype: float64

In [43]:
obj[['b','c','a']]

b    1.0
c    2.0
a    0.0
dtype: float64

In [44]:
obj[[1,3]]

b    1.0
d    3.0
dtype: float64

In [45]:
obj[obj<2]

a    0.0
b    1.0
dtype: float64

In [46]:
#LE Slicing sur les Series est inclusive
obj['b':'c']

b    1.0
c    2.0
dtype: float64

In [47]:
#attribuer une valeur
obj['b':'c'] = 5.0

In [48]:
obj

a    0.0
b    5.0
c    5.0
d    3.0
dtype: float64

In [49]:
#Indexing sur Dataframe
data = pd.DataFrame(np.arange(16).reshape((4,4)),
                    index=['Ohio','Colorado','Utah','New York'],
                    columns=['one','two','three','four'])

In [50]:
data

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [51]:
data['two']

Ohio         1
Colorado     5
Utah         9
New York    13
Name: two, dtype: int32

In [52]:
data[['two','three']]

          two  three
Ohio        1      2
Colorado    5      6
Utah        9     10
New York   13     14

In [53]:
data[:2]

          one  two  three  four
Ohio        0    1      2     3
Colorado    4    5      6     7

In [54]:
data[data['three']>5]

          one  two  three  four
Colorado    4    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [55]:
data < 5

            one    two  three   four
Ohio       True   True   True   True
Colorado   True  False  False  False
Utah      False  False  False  False
New York  False  False  False  False

In [57]:
data[data<5] = 0

In [58]:
data

          one  two  three  four
Ohio        0    0      0     0
Colorado    0    5      6     7
Utah        8    9     10    11
New York   12   13     14    15

In [60]:
#Selection avec 'loc' et 'iloc'
data.loc['Colorado',['two','three']]

two      5
three    6
Name: Colorado, dtype: int32

In [61]:
data.iloc[2,[3,0,1]]

four    11
one      8
two      9
Name: Utah, dtype: int32

In [62]:
data.iloc[2]

one       8
two       9
three    10
four     11
Name: Utah, dtype: int32

In [63]:
data.iloc[[1,2],[3,0,1]]

          four  one  two
Colorado     7    0    5
Utah        11    8    9

In [64]:
data.loc[:'Utah','two']

Ohio        0
Colorado    5
Utah        9
Name: two, dtype: int32

In [65]:
data.iloc[:,:3][data.three >5]

          one  two  three
Colorado    0    5      6
Utah        8    9     10
New York   12   13     14